{"config": {"output_layers": [["dense_5", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 512]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 256, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"name": "dropout_1", "rate": 0.3, "trainable": true}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_3", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"name": "dropout_2", "rate": 0.3, "trainable": true}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_4", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_5", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Model"}